In [1]:
import os
import joblib
import pandas as pd

# 데이터 로드

In [2]:
# 프랜차이즈 검수 파일
is_fch = pd.read_excel(os.path.join("..","..", "data","JS_08_category_check_franchise.xlsx"))

In [3]:
is_fch

     place.category is_fch 검수자  비고
0              스타벅스      1  유나 NaN
1            생선회-일반      0  유나 NaN
2            해장국-일반      0  유나 NaN
3        아귀찜,해물찜-일반      0  유나 NaN
4             파리바게뜨      1  유나 NaN
...             ...    ...  ..  ..
1188       제주울어멍해장국      1  홍정 NaN
1189          전설의치킨      1  홍정 NaN
1190           곱창선생      1  홍정 NaN
1191       음식,요리-일반      0  홍정 NaN
1192           남도술상      1  홍정 NaN

[1193 rows x 4 columns]

In [4]:
# 전체 리뷰
rv = joblib.load(os.path.join("..","..", "data","JS_05_reviews.pkl"))

In [9]:
rv['place.address'] = rv['place.address'].apply(lambda x: 'none' if x == '' else x)

In [10]:
rv['isseoul'] = rv['place.address'].apply(lambda x: 1 if '서울' in x.split()[0] else 0)

In [11]:
# 서울 place 개수, 서울이 아닌 place 개수
rv['isseoul'].value_counts()

1    2313253
0    1826603
Name: isseoul, dtype: int64

In [12]:
rv_sel = rv[rv['isseoul'] == 1]

In [13]:
rv_sel['place.address'].sort_values()

1461570          서울특별시 강남구 강남대로 238
2179115          서울특별시 강남구 강남대로 238
3189759          서울특별시 강남구 강남대로 238
2179129          서울특별시 강남구 강남대로 238
3076630          서울특별시 강남구 강남대로 238
                     ...
2597786            서울특별시 중랑구 중화동 95
1439382    서울특별시 중랑구 중화동 96 중화빌딩 1층
3777914    서울특별시 중랑구 중화동 96 중화빌딩 1층
503        서울특별시 중랑구 중화동 96 중화빌딩 2층
1754073          서울특별시 중랑구 중화동 99-7
Name: place.address, Length: 2313253, dtype: object

In [68]:
rv_sel.head()

,rating,body,visitCount,viewCount,thumbnail,status,media,id,__typename,idno,...,place.id,place.name,place.category,place.categoryCode,place.categoryCodes,place.phone,place.address,place.__typename,isseoul,media_count
2,4.0,,144,1,none,published,[],5ecaa2fa0387560010bed9d3,Review,4TXey,...,1902233431,산들할인마트,"슈퍼,마트-일반",223850,"[223563, 223564, 223593, 223850]",02-889-9142,서울특별시 관악구 봉천동 698-3,Place,1,none
10,4.5,,2,1,none,published,[],5ec7ec658160f100109a8368,Review,4TXey,...,1150710065,스타벅스 보라매공원R점,스타벅스,221275,"[220036, 220052, 220576, 221275]",1522-3232,"서울특별시 동작구 신대방동 395-65 파크스퀘어,보라매현대APT",Place,1,none
11,5.0,,3,1,none,published,[],5ecbe8b1b39a2500115d1dcc,Review,4TXey,...,1287040263,유가네한우곰탕 본사직영점,유가네한우곰탕,1000595,"[220036, 220037, 220069, 1000595]",02-821-5050,서울특별시 동작구 상도3동 323-4,Place,1,none
12,5.0,,115,1,none,published,[],5ecbe8a1ab6fc50010d6fdfe,Review,4TXey,...,1125542597,에스엠할인마트,"슈퍼,마트-일반",223850,"[223563, 223564, 223593, 223850]",,서울특별시 동작구 신대방동 395-69,Place,1,none
19,5.0,,145,0,none,published,[],5ecbe8e0a437330010b07268,Review,4TXey,...,1902233431,산들할인마트,"슈퍼,마트-일반",223850,"[223563, 223564, 223593, 223850]",02-889-9142,서울특별시 관악구 봉천동 698-3,Place,1,none

In [15]:
joblib.dump(rv_sel, os.path.join("..","..", "data",'JS_0501_reviews_seoul.pkl'))

['../../data/JS_0501_reviews_seoul.pkl']

In [16]:
cate = pd.read_excel(os.path.join("..","..", "data","JS_07_category.xlsx"))
cate = cate.loc[cate['카테고리분류'] == 'EAT']

# EAT으로 분류된 place가져오기

In [17]:
# EAT 으로 전처리한 카테고리 매칭하기

In [19]:
# 현재 서울 지역 plcae.category는 총 6207개
rv_sel['place.category'].nunique()

6207

In [21]:
# 그 중 EAT으로 분류된 것은 6207개
cate['place.category'].nunique()

2079

In [23]:
# 먼저 서울 리뷰의 category 및 place 정리
df = rv_sel.groupby('place.id')['id'].count().reset_index()
df['place.name'] = rv_sel.groupby('place.id')['place.name'].max().reset_index()['place.name']
df['place.category'] = rv_sel.groupby('place.id')['place.category'].max().reset_index()['place.category']
df

          place.id   id               place.name place.category
0       1000008735    3                    마산아구찜     아귀찜,해물찜-일반
1       1000020305   10                     크림데이       케이크전문-일반
2       1000021772   17                 머킹의 로얄가든           종합분식
3       1000026365   14                     마요요가       셔츠,체육복제작
4       1000034657   15                      금손찬        반찬가게-일반
...            ...  ...                      ...            ...
214877   999863325    4                   갑자기피크닉     오락,레저용품-일반
214878   999908749    8               세븐일레븐 신용산점          세븐일레븐
214879   999964959    5                      웰스팜          기업-일반
214880         nan  112                    흘리리릿디       협회,단체-일반
214881        none  150  황금문명 엘도라도 - 신비의 보물을 찾아서         한정식-일반

[214882 rows x 4 columns]

In [70]:
df['rating'] = rv_sel.groupby('place.id')['rating'].mean().reset_index()['rating']

In [24]:
# 서울의 place와 분류된 카테고리의 교집합
place_review = pd.merge(df, cate[['place.category', 'place.count']], on = 'place.category', how = 'inner')

In [25]:
place_review.columns = ['place.id', 'review.count', 'place.name', 'place.category', 'avg.review']
place_review

,place.id,review.count,place.name,place.category,avg.review
0,1000008735,3,마산아구찜,"아귀찜,해물찜-일반",335
1,1015202717,6,착한아구찜,"아귀찜,해물찜-일반",335
2,1018342724,1,마산아구꽃게해물전문점,"아귀찜,해물찜-일반",335
3,1024335284,7,원마산아구찜,"아귀찜,해물찜-일반",335
4,1030874387,1,동해아구찜,"아귀찜,해물찜-일반",335
...,...,...,...,...,...
104999,844374526,7,화정족발,화정족발,1
105000,902536213,7,파파호두 발산점,파파호두,1
105001,91350666,19,풍경마루,풍경마루,1
105002,95759559,7,10번가고깃집&쉐프의부대찌개 선릉점,10번가고깃집,1
105003,981921568,11,도발0948 마곡점,도발0948,1

In [40]:
# 각 카테고리의 평균 리뷰개수를 알아보기
temp = place_review.groupby('place.category')['review.count'].sum().reset_index()
temp['place.count'] = place_review.groupby('place.category')['place.id'].count().reset_index()['place.id']
temp['avg.review'] = temp['review.count'] / temp['place.count']
temp

     place.category  review.count  place.count  avg.review
0        101번지남산돈까스           242           11   22.000000
1         101커피컨테이너            26            6    4.333333
2           10번가고깃집             7            1    7.000000
3            135튀김집            14            1   14.000000
4               19티           137           10   13.700000
...             ...           ...          ...         ...
2066           히노아지            82            9    9.111111
2067            히바린            47            3   15.666667
2068           히즈빈스             7            2    3.500000
2069            히코코            84           12    7.000000
2070        힐링카페-일반            42            9    4.666667

[2071 rows x 4 columns]

In [41]:
place_review = pd.merge(place_review, temp, on = 'place.category', how = 'inner')

In [45]:
place_review = place_review[['place.id', 'place.category', 'place.name', 'review.count_x','review.count_y', 'place.count', 'avg.review_y' ]]

In [48]:
place_review = place_review.rename(columns = {'review.count_x' : 'review.count', 'review.count_y' : 'review.allcount', 'avg.review_y' : 'review.avgcount'})

In [49]:
place_review

,place.id,place.category,place.name,review.count,review.allcount,place.count,review.avgcount
0,1000008735,"아귀찜,해물찜-일반",마산아구찜,3,2443,333,7.336336
1,1015202717,"아귀찜,해물찜-일반",착한아구찜,6,2443,333,7.336336
2,1018342724,"아귀찜,해물찜-일반",마산아구꽃게해물전문점,1,2443,333,7.336336
3,1024335284,"아귀찜,해물찜-일반",원마산아구찜,7,2443,333,7.336336
4,1030874387,"아귀찜,해물찜-일반",동해아구찜,1,2443,333,7.336336
...,...,...,...,...,...,...,...
104999,844374526,화정족발,화정족발,7,7,1,7.000000
105000,902536213,파파호두,파파호두 발산점,7,7,1,7.000000
105001,91350666,풍경마루,풍경마루,19,19,1,19.000000
105002,95759559,10번가고깃집,10번가고깃집&쉐프의부대찌개 선릉점,7,7,1,7.000000
105003,981921568,도발0948,도발0948 마곡점,11,11,1,11.000000

In [60]:
# 프랜차이즈 검수와 합치기
place_review = pd.merge(place_review, is_fch, on = 'place.category', how = 'right')

In [62]:
place_review = place_review.drop(['검수자', '비고'], axis = 1)

In [66]:
# place 당 리뷰개수가 해당 카테고리 리뷰 평균과의 비율
place_review['isvalid'] = place_review['review.count'] / place_review['review.avgcount']

In [67]:
# place 리뷰개수가 해당 카테고리 평균을 넘고, 리뷰개수가 20개 이상인 place는 13551개
place_review.loc[(place_review['isvalid'] >= 1) & (place_review['review.count'] > 20)]

,place.id,place.category,place.name,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid
27,11679292,"아귀찜,해물찜-일반",옛날집낙원아구찜,22,2443,333,7.336336,0,2.998772
28,11679479,"아귀찜,해물찜-일반",통나무식당 낙원본점,24,2443,333,7.336336,0,3.271388
41,12018058,"아귀찜,해물찜-일반",알부자알요리,67,2443,333,7.336336,0,9.132624
85,1385905638,"아귀찜,해물찜-일반",해다원해물찜,21,2443,333,7.336336,0,2.862464
102,1505588868,"아귀찜,해물찜-일반",개나리아구찜 송파점,27,2443,333,7.336336,0,3.680311
...,...,...,...,...,...,...,...,...,...
99922,575510498,폴리스,폴리스 파미에스테이션점,52,194,4,48.500000,1,1.072165
99923,909606899,폴리스,폴리스 광화문D타워점,55,194,4,48.500000,1,1.134021
99926,38473337,95도씨카페,95도씨카페 가산벽산6차점,24,43,3,14.333333,1,1.674419
99927,41986281,고수닭갈비,고수닭갈비 강남2호점,24,24,1,24.000000,1,1.000000
99928,790314567,곱창선생,곱창선생 논현점,21,21,1,21.000000,1,1.000000

# 프랜차이즈로 분류된 place의 평균 평점 4.5 이상인 곳만 살리기

In [71]:
# 서울지역의 place별 평균 리뷰
df

          place.id   id               place.name place.category    rating
0       1000008735    3                    마산아구찜     아귀찜,해물찜-일반  4.666667
1       1000020305   10                     크림데이       케이크전문-일반  4.250000
2       1000021772   17                 머킹의 로얄가든           종합분식  3.735294
3       1000026365   14                     마요요가       셔츠,체육복제작  4.250000
4       1000034657   15                      금손찬        반찬가게-일반  3.900000
...            ...  ...                      ...            ...       ...
214877   999863325    4                   갑자기피크닉     오락,레저용품-일반  4.750000
214878   999908749    8               세븐일레븐 신용산점          세븐일레븐  4.625000
214879   999964959    5                      웰스팜          기업-일반  4.600000
214880         nan  112                    흘리리릿디       협회,단체-일반  4.285714
214881        none  150  황금문명 엘도라도 - 신비의 보물을 찾아서         한정식-일반  4.146667

[214882 rows x 5 columns]

In [76]:
place_review = pd.merge(place_review, df[['place.id', 'rating']], on = 'place.id', how = 'left')

In [90]:
# 프랜차이즈가 아닌 place 67643개
place_review.loc[place_review['is_fch'] == 0, 'place.name'].nunique()

67643

In [84]:
# 프랜차이즈가 아닌 카테고리 248개
place_review.loc[place_review['is_fch'] == 0, 'place.category'].nunique()

248

In [91]:
# 프랜차이즈가 아닌 place 21686개
place_review.loc[place_review['is_fch'] == 1, 'place.name'].nunique()

21686

In [83]:
# 프랜차이즈인 카테고리 944개
place_review.loc[place_review['is_fch'] == 1, 'place.category'].nunique()

944

In [88]:
place_review['is_select'] = place_review.loc[place_review['is_fch'] == 1, 'rating'].apply(lambda x : 1 if x >= 4.5 else 0)

In [93]:
place_review.loc[place_review['is_select'].isnull(), 'is_select'] = 1

In [97]:
place_review

,place.id,place.category,place.name,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid,rating,is_select
0,1000008735,"아귀찜,해물찜-일반",마산아구찜,3,2443,333,7.336336,0,0.408923,4.666667,1.0
1,1015202717,"아귀찜,해물찜-일반",착한아구찜,6,2443,333,7.336336,0,0.817847,4.416667,1.0
2,1018342724,"아귀찜,해물찜-일반",마산아구꽃게해물전문점,1,2443,333,7.336336,0,0.136308,5.000000,1.0
3,1024335284,"아귀찜,해물찜-일반",원마산아구찜,7,2443,333,7.336336,0,0.954155,4.214286,1.0
4,1030874387,"아귀찜,해물찜-일반",동해아구찜,1,2443,333,7.336336,0,0.136308,4.000000,1.0
...,...,...,...,...,...,...,...,...,...,...,...
99924,38473300,95도씨카페,95도씨카페 롯데it캐슬점,2,43,3,14.333333,1,0.139535,4.000000,0.0
99925,38473330,95도씨카페,95도씨카페 구로지플러스점,17,43,3,14.333333,1,1.186047,3.647059,0.0
99926,38473337,95도씨카페,95도씨카페 가산벽산6차점,24,43,3,14.333333,1,1.674419,4.666667,1.0
99927,41986281,고수닭갈비,고수닭갈비 강남2호점,24,24,1,24.000000,1,1.000000,4.000000,0.0
99928,790314567,곱창선생,곱창선생 논현점,21,21,1,21.000000,1,1.000000,4.476190,0.0

In [122]:
place_review['place.category'].nunique()

1193

In [99]:
temp = place_review.loc[(place_review['is_select'] == 1) & (place_review['isvalid'] >= 1) & (place_review['review.count'] >= 20)]

In [102]:
temp['place.category'].nunique(), temp['place.name'].nunique()

(734, 9517)

In [109]:
temp.loc[temp['place.category'] == '스타벅스']

,place.id,place.category,place.name,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid,rating,is_select
81571,1024248869,스타벅스,스타벅스 공덕점,198,82039,527,155.671727,1,1.271907,4.540404,1.0
81572,1035550023,스타벅스,스타벅스 홍대공항철도역점,337,82039,527,155.671727,1,2.164812,4.568249,1.0
81575,1060245770,스타벅스,스타벅스 우장산역점,190,82039,527,155.671727,1,1.220517,4.505263,1.0
81583,1086067689,스타벅스,스타벅스 강남R점,406,82039,527,155.671727,1,2.608052,4.552956,1.0
81589,1150710065,스타벅스,스타벅스 보라매공원R점,237,82039,527,155.671727,1,1.522434,4.590717,1.0
...,...,...,...,...,...,...,...,...,...,...,...
82080,736523245,스타벅스,스타벅스 문정역점,191,82039,527,155.671727,1,1.226941,4.528796,1.0
82082,791167030,스타벅스,스타벅스 가양역점,200,82039,527,155.671727,1,1.284755,4.502500,1.0
82086,838819922,스타벅스,스타벅스 상왕십리역점,156,82039,527,155.671727,1,1.002109,4.567308,1.0
82094,923777626,스타벅스,스타벅스 스타필드코엑스몰R점,449,82039,527,155.671727,1,2.884275,4.565702,1.0
82096,99828703,스타벅스,스타벅스 서강대흥역점,169,82039,527,155.671727,1,1.085618,4.529586,1.0

In [163]:
rv_sel_select = pd.merge(rv_sel, temp['place.id'], on = 'place.id', how = 'inner')

In [164]:
rv_sel_select.columns

Index(['rating', 'body', 'visitCount', 'viewCount', 'thumbnail', 'status',
       'media', 'id', '__typename', 'idno', 'visitedDate.date',
       'visitedDate.displayDate', 'visitedDate.displayDateTime',
       'visitedDate.__typename', 'place.id', 'place.name', 'place.category',
       'place.categoryCode', 'place.categoryCodes', 'place.phone',
       'place.address', 'place.__typename', 'isseoul', 'media_count'],
      dtype='object')

In [165]:
rv_sel_select['idno'].nunique(), rv_sel_select['place.category'].nunique()

(34274, 812)

In [175]:
rv_sel_select['place.name'].nunique()

10740

In [174]:
rv_sel_select['place.id'].nunique()

9866

In [168]:
rv_sel_select['place.id'].sort_values()

172121    1000055434
172091    1000055434
172090    1000055434
172089    1000055434
172088    1000055434
             ...
232200          none
232199          none
232198          none
232196          none
232140          none
Name: place.id, Length: 423462, dtype: object

In [156]:
# 같은 곳인데 place.id가 다른 경우가 있음
temp.loc[temp.duplicated('place.name', keep = False) == True].sort_values('place.name')

,place.id,place.category,place.name,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid,rating,is_select
28240,1101064446,"카페,디저트-일반",1인1잔,151,76934,7641,10.068577,0,14.997153,4.291391,1.0
27881,1047335571,"카페,디저트-일반",1인1잔,22,76934,7641,10.068577,0,2.185016,4.227273,1.0
75218,1101429921,일본식라면-일반,가로수길마루,26,3278,253,12.956522,0,2.006711,3.788462,1.0
37112,1313926828,일식당-일반,가로수길마루,26,19639,2121,9.259312,0,2.807984,4.115385,1.0
37074,12865466,일식당-일반,가쯔레쯔,25,19639,2121,9.259312,0,2.699985,4.580000,1.0
...,...,...,...,...,...,...,...,...,...,...,...
8241,1779134506,중식당-일반,희래식당,42,36248,3733,9.710153,0,4.325370,4.202381,1.0
8173,1739977821,중식당-일반,희래식당,60,36248,3733,9.710153,0,6.179100,4.450000,1.0
6623,1055860476,중식당-일반,희래식당,24,36248,3733,9.710153,0,2.471640,4.166667,1.0
38215,33626741,일식당-일반,히메시야,53,19639,2121,9.259312,0,5.723968,4.349057,1.0
37823,1862295844,일식당-일반,히메시야,30,19639,2121,9.259312,0,3.239982,4.100000,1.0

# place 위치정보 불러오기

In [177]:
# place 위치정보
place_loc = pd.read_excel(os.path.join("..","..", "data","JS_06_place_loc.xlsx"))

In [186]:
select_place = temp.merge(place_loc, on = 'place.id', how = 'left')

In [192]:
select_place.to_excel(os.path.join("..","..", "data","JS_0601_select_place.xlsx"))

# 선택된 place에 따른 리뷰 선택하기

In [204]:
rv_sel_select.loc[rv_sel_select.duplicated(['idno', 'place.id'], keep = False) == True].sort_values(['idno', 'visitCount'])

,rating,body,visitCount,viewCount,thumbnail,status,media,id,__typename,idno,...,place.id,place.name,place.category,place.categoryCode,place.categoryCodes,place.phone,place.address,place.__typename,isseoul,media_count
60780,5.0,메뉴중 비엔나 커피가 제일 맛있어요.,1,3,https://myplace-phinf.pstatic.net/20200325_74/...,published,"[{'type': 'IMAGE', 'thumbnail': 'https://mypla...",5e7b37ef99bc8e00129921c5,Review,102cA,...,1972929313,비엔나커피하우스 압구정극동타워점,비엔나커피하우스,232021,"[220036, 220052, 220576, 232021]",02-548-1683,서울특별시 강남구 신사동 575,Place,1,1
60779,5.0,아메리카노 보다는 비엔나 커피가 맛있네요.,2,2,none,published,[],5e7b3def4e8dde00121f523b,Review,102cA,...,1972929313,비엔나커피하우스 압구정극동타워점,비엔나커피하우스,232021,"[220036, 220052, 220576, 232021]",02-548-1683,서울특별시 강남구 신사동 575,Place,1,0
60778,5.0,애플블랙티에이드는 예뻐요.ㅎㅎ\n역시 여기는\n비엔나 커피가 맛있는 집입니다.^^,3,3,https://myplace-phinf.pstatic.net/20200416_251...,published,"[{'type': 'IMAGE', 'thumbnail': 'https://mypla...",5e97c23cdf22f50010a1269d,Review,102cA,...,1972929313,비엔나커피하우스 압구정극동타워점,비엔나커피하우스,232021,"[220036, 220052, 220576, 232021]",02-548-1683,서울특별시 강남구 신사동 575,Place,1,1
350393,4.0,,1,0,none,published,[],5dff1056d7bf9300100dcd90,Review,102yh,...,1036918009,공차 마포역점,공차,221396,"[220036, 220052, 220580, 221396]",02-713-7070,서울특별시 마포구 도화동 555,Place,1,0
350392,4.0,,2,0,none,published,[],5e02d1b5380c320010d1f641,Review,102yh,...,1036918009,공차 마포역점,공차,221396,"[220036, 220052, 220580, 221396]",02-713-7070,서울특별시 마포구 도화동 555,Place,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
111903,3.0,일반 칼국수집이랑 비슷해요,2,0,none,published,[],5d89c7b2dffd950010593b7c,Review,zzOc,...,19877546,공항칼국수,"칼국수,만두-일반",220712,"[220036, 220037, 220073, 220712]",02-2664-9748,서울특별시 강서구 공항동 49-2 이스카이오피스텔 지하1층,Place,1,0
70446,3.0,식빵맛잇어요,3,0,none,published,[],5da4767f9efbde00105c4edc,Review,zzOc,...,1617548667,식빵은 여기,베이커리-일반,221161,"[220036, 220052, 220564, 221161]",02-422-9747,"서울특별시 송파구 잠실동 8 잠실역지하도상가 B-19, 20호",Place,1,0
149343,5.0,좋아요,1,1,none,published,[],5ea833aeb39a25001126d5dc,Review,zzi2,...,1177971007,바삭마차,돈가스-일반,220812,"[220036, 220038, 220082, 220812]",02-336-4486,서울특별시 마포구 망원동 412-52,Place,1,none
149342,5.0,좋아요,2,1,none,published,[],5ea834285ebee00011fe82bd,Review,zzi2,...,1177971007,바삭마차,돈가스-일반,220812,"[220036, 220038, 220082, 220812]",02-336-4486,서울특별시 마포구 망원동 412-52,Place,1,none
149341,5.0,좋아요,3,1,none,published,[],5ec0d929d9c75000118c754b,Review,zzi2,...,1177971007,바삭마차,돈가스-일반,220812,"[220036, 220038, 220082, 220812]",02-336-4486,서울특별시 마포구 망원동 412-52,Place,1,none

In [219]:
rv_sel_select[['idno', 'place.id','visitCount']].sort_values('visitCount')

         idno    place.id  visitCount
401755  2HUrC  1297540314           0
298903  22KMK    37755265           0
20797   69eAF    12035791           0
366982   DaLN    20256302           0
20794   7TGW8    12035791           0
...       ...         ...         ...
246546  14EH4    37591629         148
246545  14EH4    37591629         149
246544  14EH4    37591629         150
246543  14EH4    37591629         151
246542  14EH4    37591629         152

[423462 rows x 3 columns]

In [220]:
rv_sel_select.drop_duplicates(['idno', 'place.id']).sort_values(['idno', 'place.id','visitCount'])[['idno', 'place.id','visitCount']].sort_values('visitCount')

         idno    place.id  visitCount
298903  22KMK    37755265           0
232155  3a5d5        none           0
310030   CIcl    11699759           0
301259  4rLT1    11714935           0
393382   CIcl  1251024640           0
...       ...         ...         ...
357997  6QGal    38668111         103
422694   rlDo  1621006573         115
262484   SeIu    13475534         131
246696  2cw6W    37591629         136
246542  14EH4    37591629         152

[334027 rows x 3 columns]

In [222]:
rv_sel_select = rv_sel_select.drop_duplicates(['idno', 'place.id'])

In [223]:
rv_sel_select.to_excel(os.path.join("..","..", "data","JS_0502_reviews_seoul_select.xlsx"))
joblib.dump(rv_sel_select, os.path.join("..","..", "data","JS_0502_reviews_seoul_select.pkl"))

['../../data/JS_0502_reviews_seoul_select.pkl']

In [229]:
rv_sel_select['idno'].nunique(), rv_sel_select['place.category'].nunique(), rv_sel_select['place.id'].nunique(), rv_sel_select['place.name'].nunique()

(34274, 812, 9866, 10683)

![alt text](JS_NV_processing.png "Title")

In [237]:
rv_sel_select['place.name'].nunique()

10683

In [238]:
rv_sel_select['place.id'].nunique()

9866

In [255]:
(rv_sel_select.drop_duplicates('place.name')[['place.id', 'place.name']].duplicated('place.id', keep = 'last'))

1189

# 한 id에 다른 place.name이 있는 경우 처리

In [265]:
# place.id 당 몇개의 place.name을 가지고있는지
temp = rv_sel_select.groupby('place.id')['place.name'].nunique().reset_index().sort_values('place.name')

In [275]:
# 1개 이상의 name을 가지고 있는 것 추출
duplicate_place_id = temp.loc[temp['place.name'] > 1, 'place.id']

In [276]:
duplicate_place_id

5086    1875639166
4792      18377257
4646    1819102179
4498    1796334110
9293      43229792
           ...
186     1038438512
6223      21607745
9387     535057415
8775      38010058
9865          none
Name: place.id, Length: 1061, dtype: object

In [296]:
# 예시
rv_sel.loc[rv_sel['place.id'] == '1368824611', 'place.name']

158892      슝모사부
166657      슝모사부
214580     춘리마라탕
683827     춘리마라탕
851326      슝모사부
943436      탕절대부
1042693    춘리마라탕
1084170    춘리마라탕
1120846    춘리마라탕
1777581     슝모사부
1777731    춘리마라탕
1996178    춘리마라탕
2002858     탕절대부
2058004     슝모사부
2209697    춘리마라탕
2209707    춘리마라탕
2291033    춘리마라탕
2315021     슝모사부
2478423     슝모사부
2510955     슝모사부
2511035     슝모사부
2629380     탕절대부
2680749    춘리마라탕
2769824     탕절대부
3113446    춘리마라탕
3575553    춘리마라탕
3853119     탕절대부
3976971    춘리마라탕
4089759    춘리마라탕
Name: place.name, dtype: object

In [306]:
rv_sel.columns

Index(['rating', 'body', 'visitCount', 'viewCount', 'thumbnail', 'status',
       'media', 'id', '__typename', 'idno', 'visitedDate.date',
       'visitedDate.displayDate', 'visitedDate.displayDateTime',
       'visitedDate.__typename', 'place.id', 'place.name', 'place.category',
       'place.categoryCode', 'place.categoryCodes', 'place.phone',
       'place.address', 'place.__typename', 'isseoul', 'media_count'],
      dtype='object')

In [310]:
# 가장 최근의 리뷰를 참고해서 그 당시의 Place.name으로 대체
rv_sel[['visitedDate.date', 'visitedDate.displayDate', 'visitedDate.displayDateTime', 'visitedDate.__typename']]

,visitedDate.date,visitedDate.displayDate,visitedDate.displayDateTime,visitedDate.__typename
2,2020. 05. 25 01:38:00,05.25 월,2020. 05. 25 월 01:38,VisitedTime
10,2020. 05. 21 20:42:00,05.21 목,2020. 05. 21 목 20:42,VisitedTime
11,2020. 05. 21 17:20:00,05.21 목,2020. 05. 21 목 17:20,VisitedTime
12,2020. 05. 21 13:17:00,05.21 목,2020. 05. 21 목 13:17,VisitedTime
19,2020. 05. 20 12:48:00,05.20 수,2020. 05. 20 수 12:48,VisitedTime
...,...,...,...,...
4139851,2020. 03. 28 20:34:00,03.28 토,2020. 03. 28 토 20:34,VisitedTime
4139852,2020. 01. 23 21:19:00,01.23 목,2020. 01. 23 목 21:19,VisitedTime
4139853,2020. 03. 13 15:54:00,03.13 금,2020. 03. 13 금 15:54,VisitedTime
4139854,2020. 03. 13 18:06:00,03.13 금,2020. 03. 13 금 18:06,VisitedTime
4139855,2020. 01. 17 19:53:00,01.17 금,2020. 01. 17 금 19:53,VisitedTime

In [312]:
temp = rv_sel.groupby('place.id')['visitedDate.date'].max().reset_index()

In [316]:
temp.shape

(214882, 2)

In [319]:
temp = temp.merge(rv_sel[['place.id','visitedDate.date', 'place.name']], on = ['place.id','visitedDate.date'], how = 'inner')

In [328]:
temp.loc[temp.duplicated('place.id', keep = False) == True]

          place.id       visitedDate.date   place.name
3       1000026365  2020. 05. 20 14:41:00         마요요가
4       1000026365  2020. 05. 20 14:41:00         마요요가
6       1000047092  2020. 02. 13 20:16:00        제주의 봄
7       1000047092  2020. 02. 13 20:16:00        제주의 봄
27      1000216111  2020. 05. 26 12:27:00  이종구낙지세상 미아점
...            ...                    ...          ...
236724   999281674  2020. 05. 12 14:15:00   커피에반하다 공항점
236725   999281674  2020. 05. 12 14:15:00   커피에반하다 공항점
236726   999281674  2020. 05. 12 14:15:00   커피에반하다 공항점
236730   999451597  2020. 05. 15 13:18:00        명동가츠라
236731   999451597  2020. 05. 15 13:18:00        명동가츠라

[37463 rows x 3 columns]

In [330]:
# 가장 최신 place.name 으로 업데이트 완료
temp = temp.drop_duplicates()

In [331]:
temp[temp['place.id'] == '1368824611']

         place.id       visitedDate.date place.name
64823  1368824611  2020. 05. 23 14:33:00      춘리마라탕

In [334]:
select_place_temp = select_place[['place.id', 'place.category', 'review.count', 'review.allcount', 'place.count', 'review.avgcount', 'is_fch', 'isvalid', 'rating', 'is_select', 'place.address', 'land.addr', 'road.addr', 'lat', 'lng']]

In [338]:
select_place = select_place_temp.merge(temp[['place.id', 'place.name']], on = 'place.id', how = 'left')

In [339]:
# 최근 place.name 으로 업데이트 완료
select_place.to_excel(os.path.join("..","..", "data","JS_0601_select_place.xlsx"))

In [340]:
# 이름이 중복되는 place.id 가져오기

In [345]:
update_placeid = pd.DataFrame(duplicate_place_id).merge(select_place[['place.id', 'place.name']], on = 'place.id', how = 'left')

In [350]:
update_placeid = update_placeid.iloc[:-1]
update_placeid

        place.id          place.name
0     1875639166          청담초밥 방이직영점
1       18377257              우리바다수산
2     1819102179          TIS COFFEE
3     1796334110         와플대학 사가정캠퍼스
4       43229792               다모아분식
...          ...                 ...
1056  1170659632    Chai797 Plus 김포점
1057  1038438512         다섯가지일품구이519
1058    21607745           바비레드 강남본점
1059   535057415          화덕고깃간 신천본점
1060    38010058  여의도 켄싱턴호텔 브로드웨이 뷔페

[1061 rows x 2 columns]

In [355]:
rv_sel_select.loc[rv_sel_select['place.id'] == '1875639166', 'place.name']

347138    청담초밥 방이직영점
347139    청담초밥 방이직영점
347140    청담초밥 방이직영점
347141    청담초밥 방이직영점
347143    청담초밥 방이직영점
347144    청담초밥 방이직영점
347145    청담초밥 방이직영점
347146    청담초밥 방이직영점
347147    청담초밥 방이직영점
347148    청담초밥 방이직영점
347149    청담초밥 방이직영점
347150    청담초밥 방이직영점
347151    청담초밥 방이직영점
347152    청담초밥 방이직영점
347153    청담초밥 방이직영점
347154    청담초밥 방이직영점
347155    청담초밥 방이직영점
347156    청담초밥 방이직영점
347157    청담초밥 방이직영점
347158    청담초밥 방이직영점
Name: place.name, dtype: object

In [357]:
import warnings
warnings.filterwarnings(action='ignore')

In [358]:
update_placeid.values

array([['1875639166', '청담초밥 방이직영점'],
       ['18377257', '우리바다수산'],
       ['1819102179', 'TIS COFFEE'],
       ...,
       ['21607745', '바비레드 강남본점'],
       ['535057415', '화덕고깃간 신천본점'],
       ['38010058', '여의도 켄싱턴호텔 브로드웨이 뷔페']], dtype=object)

In [360]:
from tqdm import tqdm

In [361]:
for idx, name in tqdm(update_placeid.values):
    rv_sel_select.loc[rv_sel_select['place.id'] == idx, 'place.name'] = name

100%|██████████| 1061/1061 [01:33<00:00, 11.34it/s]

In [364]:
# 업데이트 완료
rv_sel_select.loc[rv_sel_select['place.id'] == '18377257', 'place.name']

96774    우리바다수산
96775    우리바다수산
96776    우리바다수산
96777    우리바다수산
96778    우리바다수산
96780    우리바다수산
96781    우리바다수산
96782    우리바다수산
96783    우리바다수산
96784    우리바다수산
96785    우리바다수산
96786    우리바다수산
96787    우리바다수산
96788    우리바다수산
96789    우리바다수산
96790    우리바다수산
96791    우리바다수산
96792    우리바다수산
96793    우리바다수산
96794    우리바다수산
96795    우리바다수산
96796    우리바다수산
96797    우리바다수산
96798    우리바다수산
96799    우리바다수산
96800    우리바다수산
96801    우리바다수산
96802    우리바다수산
96803    우리바다수산
96804    우리바다수산
96805    우리바다수산
96806    우리바다수산
96807    우리바다수산
96808    우리바다수산
96809    우리바다수산
96810    우리바다수산
96813    우리바다수산
96814    우리바다수산
96815    우리바다수산
96816    우리바다수산
96818    우리바다수산
96820    우리바다수산
96821    우리바다수산
96822    우리바다수산
96823    우리바다수산
96824    우리바다수산
96825    우리바다수산
96827    우리바다수산
96828    우리바다수산
96829    우리바다수산
96830    우리바다수산
96832    우리바다수산
96833    우리바다수산
96834    우리바다수산
96835    우리바다수산
Name: place.name, dtype: object

In [367]:
rv_sel_select['place.id'].nunique(), rv_sel_select['place.name'].nunique()

(9866, 9594)

In [370]:
rv_sel_select['place.name'].sort_values()

232159              가족뮤지컬 넌 특별하단다
232208    (부천)어린이베스트셀러뮤지컬 '사과가 쿵'
232136                     (주)엔터랩
263300                      010수산
263271                      010수산
                   ...
89961                    힛더스팟 가산점
89960                    힛더스팟 가산점
89959                    힛더스팟 가산점
89968                    힛더스팟 가산점
89962                    힛더스팟 가산점
Name: place.name, Length: 334027, dtype: object

In [390]:
temp = rv_sel_select[['place.id', 'place.name']].drop_duplicates()

In [391]:
temp.loc[temp.duplicated('place.id', keep = False) == True]

       place.id               place.name
232076     none            CONNECT, BTS
232079     none         서울일러스트레이션페어vol.9
232080     none  역사가 우리를 망쳐 놨지만 그래도 상관없다
232081     none  야수파 걸작전 : 천재 화가 키즈아틀리에
232082     none           매드포갈릭 봉은사로점(N)
...         ...                      ...
232209     none   한국의정원展 : 소쇄원, 낯설게 산책하기
232210     none                 로프트 관광호텔
232215     none                    호텔클리오
232218     none          매드포갈릭 상암MBC점(N)
232225     none         이수근의 웃음팔이소년 (종로)

[91 rows x 2 columns]

In [397]:
rv_sel_select = rv_sel_select.loc[rv_sel_select['place.id'] != 'none']

In [398]:
rv_sel_select['place.id'].nunique(), rv_sel_select['place.name'].nunique()

(9865, 9506)

In [399]:
temp = rv_sel_select[['place.id', 'place.name']].drop_duplicates()

In [402]:
# place.name은 같아도 place.id는 다른 경우가 있음
temp.loc[temp.duplicated('place.name', keep = False) == True].sort_values('place.name')

          place.id place.name
1204    1047335571       1인1잔
138302  1101064446       1인1잔
397469  1101429921     가로수길마루
71375   1313926828     가로수길마루
382963    37837722       가쯔레쯔
...            ...        ...
260839  1055860476       희래식당
31431   1739977821       희래식당
327125  1779134506       희래식당
417628  1862295844       히메시야
343639    33626741       히메시야

[632 rows x 2 columns]

In [409]:
select_place.loc[select_place['place.id'] == '1101429921']

,place.id,place.category,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid,rating,is_select,place.address,land.addr,road.addr,lat,lng,place.name
7803,1101429921,일본식라면-일반,26,3278,253,12.956522,0,2.006711,3.788462,1.0,서울특별시 중구 남대문로5가 541,서울특별시 중구 남대문로5가 541 서울스퀘어,서울특별시 중구 한강대로 416 서울스퀘어,37.555527,126.973867,가로수길마루

In [410]:
select_place.loc[select_place['place.id'] == '1313926828']

,place.id,place.category,review.count,review.allcount,place.count,review.avgcount,is_fch,isvalid,rating,is_select,place.address,land.addr,road.addr,lat,lng,place.name
3615,1313926828,일식당-일반,26,19639,2121,9.259312,0,2.807984,4.115385,1.0,서울특별시 강서구 등촌동 689,서울특별시 강서구 등촌동 689 엔씨백화점,서울특별시 강서구 강서로56길 17 엔씨백화점,37.559979,126.840342,가로수길마루

In [416]:
temp = rv_sel_select.groupby('place.id')['id'].nunique().reset_index()

In [417]:
temp

        place.id  id
0     1000055434  51
1     1000498595  21
2     1000616978  59
3     1000725407  31
4     1000771326  17
...          ...  ..
9860   993990809  30
9861    99465898  67
9862   996334906  48
9863    99828703  97
9864   999451597  21

[9865 rows x 2 columns]

In [420]:
select_place = select_place.merge(temp, on = 'place.id', how = 'left')

In [429]:
select_place = select_place.rename(columns = {'id' : 'review.count.again'})

# 저장

In [430]:
rv_sel_select.to_excel(os.path.join("..","..", "data","JS_0502_reviews_seoul_select.xlsx"))
joblib.dump(rv_sel_select, os.path.join("..","..", "data","JS_0502_reviews_seoul_select.pkl"))

['../../data/JS_0502_reviews_seoul_select.pkl']

In [431]:
select_place.to_excel(os.path.join("..","..", "data","JS_0601_select_place.xlsx"))